app/Models/ModelAuth.php

    public function loginKaryawan($username, $password)
    {
        return $this->db->table('tbl_karyawan')
            ->where([
                'username' => $username,
                'password' => $password,
            ])
            ->get()
            ->getRowArray();
---
SELECT *
FROM `tbl_karyawan`
WHERE `username` = 'jatur.com'
AND `password` = '3f37cb1035a5598527a0bd4de523498b88b3b096'