app/Models/ModelPresensi.php

    public function cekPresensi()
    {
        return $this->db->table('tbl_presensi')
            ->where('id_presensi', session()->get('id_karyawan'))
            ->where('tgl_presensi', date('Y-m-d'))
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_presensi`
WHERE `id_presensi` = '1'
AND `tgl_presensi` = '2025-01-06'