app/Models/ModelHome.php

    public function dataKaryawan()
    {
        return $this->db->table('tbl_karyawan')
                    ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan=tbl_karyawan.id_jabatan', 'LEFT')
                    ->where('id_karyawan', session()->get('id_karyawan'))->get()->getRowArray();
---
SELECT *
FROM `tbl_karyawan`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan`=`tbl_karyawan`.`id_jabatan`
WHERE `id_karyawan` = '1'